# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\pedro\Documents\Embebidos\ISEP6-Viviana\ISEP6-Viviana.cydsn\ISEP6-Viviana.cyprj
# Date: Mon, 27 Nov 2023 15:03:35 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clk2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_Atmega_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 625 1251} -nominal_period 26041.666666666664 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clk_200Hz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 120001 240001} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clk_100Hz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 240001 480001} [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\pedro\Documents\Embebidos\ISEP6-Viviana\ISEP6-Viviana.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\pedro\Documents\Embebidos\ISEP6-Viviana\ISEP6-Viviana.cydsn\ISEP6-Viviana.cyprj
# Date: Mon, 27 Nov 2023 15:03:31 GMT
